Table of Contents
 Class BucklingRes
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Results of the buckling analysis
[Serializable]
[DataContract]
public class BucklingRes
Inheritance
object
BucklingRes
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Factor
Buckling factor
[DataMember]
public double Factor { get; set; }
Property Value
double
 LoadCaseId
[DataMember]
public int LoadCaseId { get; set; }
Property Value
int
 Shape
Shape lc calculated by solver
[DataMember]
public int Shape { get; set; }
Property Value
int
 Edit this page